7Ji/esp8266-temp-monitor-and-pc-reset/src/main.cpp
    if (countL0 == MaxHistoryL0) {
      if (!headL0) {
        if (countL1 == SensorSlice::MaxRecords) {
          flushL1L2();
        }
        appendL1(valuesL0[0], unixSecondsL0[0]);
      }
      current = headL0;
      headL0 = (headL0 + 1) & RingMaskL0;
    } else {
      current = (headL0 + countL0++) & RingMaskL0;
    }

    value = valuesL0 + current;

    millisLast = millisCurrent;
    unixSeconds = ntpSyncer.currentUnixSeconds(millisCurrent);
    unixSecondsL0[current] = unixSeconds;
    value->humidInt = dht.data[0];
    value->humidDot = dht.data[1];
    value->tempInt =  static_cast<int8_t>(dht.data[2]);
    value->tempDot = dht.data[3];
  }

  void firstFetchAppend(uint32_t const millisCurrent) {
    if (countL2 > 0 && fetchPage(slicePage(countL2 - 1))) {
      ntpSyncer.ensureUnixSeconds(millisCurrent, sliceL2.unixOffset + sliceL2.records[SensorSlice::MaxRecordsSub1].timestamp);
    }
    dht.begin();
    fetchAppend(millisCurrent);
  }

  void maybeFetchAppend(uint32_t const millisCurrent) {
    if (millisCurrent - millisLast >= MinInterval) {
      fetchAppend(millisCurrent);
    }
  }
};

static SensorHistory history = {};

void httpHandleLast() {
  SensorValue &value = history.last();
  int r;

  r = snprintf(sharedStrBuffer, SensorValue::lenBufferTempAndHumid, "%" PRId8 ".%" PRIu8 ",%" PRIu8 ".%" PRIu8 "", value.tempInt, value.tempDot, value.humidInt, value.humidDot);
  if (r < 0) {
    serverSendError(StringFormatFailure);
    return;
  }
  if (r >= SensorValue::lenBufferTempAndHumid) {
    serverSendError(StringWouldTruncate);
    return;
  }
  server.send(200, "text/plain", sharedStrBuffer, r);
}

void httpHandleTemp() {
  SensorValue &value = history.last();
  int r;

  r = snprintf(sharedStrBuffer, SensorValue::lenBufferTempOrHumid, "%" PRId8 ".%" PRIu8 "", value.tempInt, value.tempDot);
  if (r < 0) {
    serverSendError(StringFormatFailure);
    return;
  }
  if (r >= SensorValue::lenBufferTempOrHumid) {
    serverSendError(StringWouldTruncate);
    return;
  }
  server.send(200, "text/plain", sharedStrBuffer, r);
}

void httpHandleHumid() {
  SensorValue &value = history.last();
  int r;

  r = snprintf(sharedStrBuffer, SensorValue::lenBufferTempOrHumid, "%" PRIu8 ".%" PRIu8 "", value.humidInt, value.humidDot);
  if (r < 0) {
    serverSendError(StringFormatFailure);
    return;
  }
  if (r >= SensorValue::lenBufferTempOrHumid) {
    serverSendError(StringWouldTruncate);
    return;
  }
  server.send(200, "text/plain", sharedStrBuffer, r);
}

void httpHandleNotFound() {
  server.send_P(404, "text/plain", ErrorNotFound, sizeof(ErrorNotFound) - 1);
}

bool serverIsAuthorized() {
  static String const AuthExpected = String("Bearer " PRIVATE_PC_AUTH);
  static String const HeaderAuthorization = String("Authorization");

  if (!server.hasHeader(HeaderAuthorization)) {
    return false;
  }

  return server.header(HeaderAuthorization) == AuthExpected;
}

void pulseButton(uint8_t const pin) {
  digitalWrite(pin, HIGH);
  delay(250);
  digitalWrite(pin, LOW);
}

void httpHandlePower() {
  if (!serverIsAuthorized()) {
    httpHandleNotFound();
    return;
  }

  pulseButton(PcPinPower);
  server.send_P(200, "text/plain", PcPowerOk, sizeof(PcPowerOk) - 1);
}

void httpHandleReset() {
  if (!serverIsAuthorized()) {
    httpHandleNotFound();
    return;
  }

  pulseButton(PcPinReset);
  server.send_P(200, "text/plain", PcResetOk, sizeof(PcResetOk) - 1);
}

#ifdef PRIVATE_ALLOW_CROSS
void serverSendHeadersForRaw() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Cache-Control", "no-store");
}
#endif

struct RawAllSender {
  COMPCONST size_t const lenBuffer = SharedBufferSize;
  COMPCONST size_t const lenMax = SharedBufferSize - SensorValue::lenBuffer;

  size_t len;
  size_t offset = 0;

  RawAllSender() {
    server.setContentLength(CONTENT_LENGTH_UNKNOWN);
#ifdef PRIVATE_ALLOW_CROSS
    serverSendHeadersForRaw();
#endif
    server.send(200, "text/plain", "", 0);
  }

  void sendValue(uint64_t const unixSeconds, SensorValue const &value) {
    if (value.intoStr(unixSeconds, sharedStrBuffer + offset, len)) {
      if ((offset += len) >= lenMax) {
        server.sendContent(sharedStrBuffer, offset);
        offset = 0;
      }
    }
  }

  void sendRingRecords(SensorValue const *values, uint64_t const *unixSeconds, uint8_t const head, uint8_t const count) {
    uint8_t i;

    for (i = head; i < count; ++i) {
      sendValue(unixSeconds[i], values[i]);
    }
    for (i = 0; i < head; ++i) {
      sendValue(unixSeconds[i], values[i]);
    }
  }

  void sendSlice(SensorSlice const &slice, uint16_t const count = SensorSlice::MaxRecords) {
    uint64_t const unixOffset = slice.unixOffset;
    SensorRecord const *record;
    uint16_t i;

    for (i = 0; i < count; ++i) {
      record = slice.records + i;
      sendValue(unixOffset + record->timestamp, record->value);
    }
  }

  void sendPage(uint16_t const pageID) {
    if (!history.fetchPage(pageID)) {
      return;
    }
    sendSlice(history.sliceL2);
  }

  void sendAll() {
    uint16_t i, pageOffset;

    if (history.countL2 > 0) {
      pageOffset = history.firstPage();
      if (pageOffset > 0) {
        for (i = pageOffset; i < FlashStats::PageTotal; ++i) {
          sendPage(i);
        }
        pageOffset = history.countL2 + pageOffset - FlashStats::PageTotal;
        for (i = 0; i < pageOffset; ++i) {
          sendPage(i);
        }
      } else {
        for (i = 0; i < history.countL2; ++i) {
          sendPage(i);
        }
      }
    }
    if (history.countL1 > 0) {
      sendSlice(history.sliceL1, history.countL1);
    }
    if (history.countL0 > 0) {
      sendRingRecords(history.valuesL0, history.unixSecondsL0, history.headL0, history.countL0);
    }

  }

  ~RawAllSender() {
    if (offset) {
      server.sendContent(sharedStrBuffer, offset);
    }
    server.sendContent("", 0);
  }
};

void httpHandleHistory() {
  RawAllSender sender = {};

  sender.sendAll();
}

struct DumpAllSender {
  COMPCONST size_t const lenBuffer = SharedBufferSize;
  COMPCONST size_t const lenMax = SharedBufferSize - sizeof(DumpRecord);

  uint64_t unixOffset = 0;
  size_t offset = 0;

  DumpAllSender() {
    uint32_t const totalCount = history.totalCount();

    server.setContentLength(DumpHeaderSize + totalCount * sizeof(DumpRecord));
#ifdef PRIVATE_ALLOW_CROSS
    serverSendHeadersForRaw();
#endif
    if (totalCount > 0) {
      history.first(unixOffset);
    }
    memcpy(sharedBytesBuffer, "E82\1", 4); /* Magic "E82", dump format version 1 */
    memcpy(sharedBytesBuffer + 4, &totalCount, sizeof(totalCount));
    memcpy(sharedBytesBuffer + 8, &unixOffset, sizeof(unixOffset));
    server.send(200, "application/octet-stream", "", 0);
    server.sendContent(sharedStrBuffer, DumpHeaderSize);
  }

  void sendValue(uint64_t const unixSeconds, SensorValue const &value) {
    DumpRecord *const record = reinterpret_cast<DumpRecord *>(sharedBytesBuffer + offset);

    record->timestamp = unixSeconds - unixOffset;
    record->value = value;
    if ((offset += sizeof(DumpRecord)) >= lenMax) {
      server.sendContent(sharedStrBuffer, offset);
      offset = 0;
    }
  }

